In [1]:
#Trabalhando com planilhas excel
import pandas as pd

In [2]:
#atribuido cada planilha a uma variavel vamos fazer o tratamento dos dados
aju = pd.read_excel("datasets/Aracaju.xlsx")
nat = pd.read_excel("datasets/Natal.xlsx")
rfe = pd.read_excel("datasets/Recife.xlsx")
fot = pd.read_excel("datasets/Fortaleza.xlsx")
ssa = pd.read_excel("datasets/Salvador.xlsx")

In [3]:
#exibindo o head para verificar se é possivel juntar os os dfs em um unico
aju.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [4]:
vendas = pd.concat([aju, nat, rfe, fot, ssa])

In [5]:
vendas["Vendas"].mean()

122.61180089485458

In [6]:
#é possivel exibir uma amostra dos dados
#isso pode ser util para verificar se a junção deu certo
vendas.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
65   Fortaleza 2019-01-01  145.20    1005     2
229      Natal 2019-01-02   43.08    1036     2
79       Natal 2019-02-28  557.00     852     4
27     Aracaju 2018-01-01    3.39    1523     4
25       Natal 2019-01-13  611.00     852     2

In [7]:
#verificando o tipo de arquivo em cada coluna do nosso df
vendas.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [13]:
#transformando a coluna LojaID no tipo object ja que estao nao sera utilizado como calculo
vendas["LojaID"] = vendas["LojaID"].astype("object")

In [14]:
#verificando valores faltantes (nulos)

vendas.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

Não se aplica ao caso, mas caso hovessem valores nulos na ultima verificação utilizariamos o comando:

vendas["Vendas"].fillna(vendas["Vendas"].mean(), inplace=True)

implica que no df vendas, na coluna Vendas os valores nulos serão preenchidos com a media dos valores e modificando a informação tambem na memoria, nao apenas na linha de comando

podemos tambem utilizar no lugar de vendas["Vendas"].mean() 
substituir por 0 
apagar as linhas nulas

vendas.dropna(inplace=True) para todas as linhas nulas no df
Se for necessario espeficicar colunas usamos o 

vendas.dropna(subset=["Vendas"], inplace= True)

Para remover linhas onde todos os valores em todas as tabelas estejam faltantes, usamos

vendas.dropna(how="all", inplace=True)

In [19]:
#criano novas colunas do df

vendas["Receita"] = vendas["Vendas"].mul(vendas["Qtde"])

Caso seja adicionado acidentalmente uma coluna podemos remove-la utilizando o metodo .drop e passar o nome da coluna como mostra abaixo. É importante passar o parametro inplace para que os dados persistam em memoria

In [44]:
#vendas.drop(columns=['Receitas'], inplace=True)
vendas.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [38]:
#O mair valor em receita
vendas["Receita"].max()

3544.0

In [39]:
#O menor valor em receita
vendas["Receita"].min()

3.34

In [42]:
#Quais foram as 3 melhores lojas e suas respectivas receitas
vendas.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
51  Natal 2018-01-21   859.0    852     4   3436.0
55  Natal 2019-01-08   859.0    854     4   3436.0

In [45]:
#Quais foram as piores
vendas.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita
118  Aracaju 2018-01-01    3.34   1522     1     3.34
65    Recife 2019-01-01    4.01    981     1     4.01
92     Natal 2019-01-02    4.57   1035     1     4.57

In [48]:
#agrupando as receitas por cidade
vendas.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [49]:
#Exibindo os dados de forma ordenada
vendas.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
51  Natal 2018-01-21   859.0    852     4   3436.0
55  Natal 2019-01-08   859.0    854     4   3436.0
30  Natal 2018-10-02   856.0    853     4   3424.0
41  Natal 2018-05-20   835.0    852     4   3340.0
10  Natal 2018-10-27   828.0    852     4   3312.0
38  Natal 2018-02-25   828.0    852     4   3312.0
69  Natal 2019-03-24   817.0    852     4   3268.0
62  Natal 2018-02-10   793.0    854     4   3172.0
52  Natal 2018-04-27   778.0    854     4   3112.0